lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static size_t build_subevent_continue_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 24U) {
    return 0U;
  }
  bytes_zero(payload, 24U);
  write_le16(&payload[0], conn_handle);
  payload[2] = 1U;
  payload[3] = 0U;
  payload[4] = 0U;
  payload[5] = 0U;
  payload[6] = 2U;
  payload[7] = 2U;
  append_mode2_demo_step(&payload[8], 24U);
  append_mode2_demo_step(&payload[16], 36U);
  return 24U;
}

static uint16_t read_opcode(void) {
  if (g_host_transport->hostLen < 4U) {
    return 0U;
  }
  if (g_host_transport->hostData[0] != 0x01U) {
    return 0U;
  }
  return (uint16_t)g_host_transport->hostData[1] |
         ((uint16_t)g_host_transport->hostData[2] << 8U);
}

static size_t build_vendor_ping_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t echoedCookie = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen >= 8U) {
    echoedCookie = (uint32_t)g_host_transport->hostData[4] |
                   ((uint32_t)g_host_transport->hostData[5] << 8U) |
                   ((uint32_t)g_host_transport->hostData[6] << 16U) |
                   ((uint32_t)g_host_transport->hostData[7] << 24U);
  }
  payload[0] = 0U;
  write_le32(&payload[1], echoedCookie);
  write_le32(&payload[5], g_vpr_transport->heartbeat);
  return 9U;
}

static size_t build_vendor_info_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 12U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_vpr_transport->status & 0xFFU);
  payload[2] = (uint8_t)(g_vpr_transport->lastError & 0xFFU);
  payload[3] = (uint8_t)(g_vpr_transport->vprFlags & 0xFFU);
  if (g_restored_from_hibernate != 0U) {
    payload[3] = (uint8_t)(payload[3] | VPR_VENDOR_TRANSPORT_FLAG_RESTORED_FROM_HIBERNATE);
  }
  write_le32(&payload[4], g_vpr_transport->heartbeat);
  write_le32(&payload[8], g_host_transport->scriptCount);
  return 12U;
}

static size_t build_vendor_capabilities_complete_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 11U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = VPR_VENDOR_SERVICE_VERSION_MAJOR;
  payload[2] = VPR_VENDOR_SERVICE_VERSION_MINOR;
  write_le32(&payload[3],
             VPR_VENDOR_OP_PING |
             VPR_VENDOR_OP_INFO |
             VPR_VENDOR_OP_FNV1A32 |
             VPR_VENDOR_OP_CAPABILITIES |
             VPR_VENDOR_OP_CRC32 |
             VPR_VENDOR_OP_CRC32C |
             VPR_VENDOR_OP_TICKER_CONFIGURE |
             VPR_VENDOR_OP_TICKER_READ_STATE |
             VPR_VENDOR_OP_ENTER_HIBERNATE |
             VPR_VENDOR_OP_TICKER_EVENT_CONFIGURE);
  write_le32(&payload[7], NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U);
  return 11U;
}

static uint32_t fnv1a32_bytes(const uint8_t *data, size_t len) {
  uint32_t hash = 2166136261UL;
  if (data == NULL) {
    return hash;
  }
  for (size_t i = 0U; i < len; ++i) {
    hash ^= (uint32_t)data[i];
    hash *= 16777619UL;
  }
  return hash;
}

static size_t build_vendor_fnv1a_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t hash = 2166136261UL;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    hash = fnv1a32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], hash);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0xEDB88320UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static uint32_t crc32c_bytes(const uint8_t *data, size_t len) {
  uint32_t crc = 0xFFFFFFFFUL;
  if (data == NULL) {
    return crc ^ 0xFFFFFFFFUL;
  }
  for (size_t i = 0U; i < len; ++i) {
    crc ^= (uint32_t)data[i];
    for (uint8_t bit = 0U; bit < 8U; ++bit) {
      const uint32_t mask = -(crc & 1U);
      crc = (crc >> 1U) ^ (0x82F63B78UL & mask);
    }
  }
  return crc ^ 0xFFFFFFFFUL;
}

static size_t build_vendor_crc32c_complete_payload(uint8_t *payload, size_t max_len) {
  uint32_t processedLen = 0U;
  uint32_t crc = 0U;
  if (payload == NULL || max_len < 9U) {
    return 0U;
  }
  if (g_host_transport->hostLen > 4U) {
    processedLen = g_host_transport->hostLen - 4U;
    if (processedLen > (NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U)) {
      processedLen = NRF54L15_VPR_TRANSPORT_MAX_HOST_DATA - 4U;
    }
    crc = crc32c_bytes((const uint8_t *)&g_host_transport->hostData[4], processedLen);
  }
  payload[0] = 0U;
  write_le32(&payload[1], crc);
  write_le32(&payload[5], processedLen);
  return 9U;
}

static size_t build_vendor_ticker_state_payload(uint8_t *payload, size_t max_len) {
  if (payload == NULL || max_len < 14U) {
    return 0U;
  }
  payload[0] = 0U;
  payload[1] = (uint8_t)(g_ticker_enabled != 0U ? 1U : 0U);
  write_le32(&payload[2], g_ticker_period_ticks);
  write_le32(&payload[6], g_ticker_step);
  write_le32(&payload[10], g_ticker_count);
  return 14U;
}

